---
type: RebarPropagation
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarPropagation

`Autodesk.Revit.DB.Structure.RebarPropagation` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AlignByFace | 2023 | `public static ISet < ElementId > AlignByFace ( Document doc , IList < Rebar > sourceRebars , Reference sourceFaceReference , Reference destinationFaceReference )` |
| Method | AlignByHost | 2023 | `public static ISet < ElementId > AlignByHost ( Document doc , IList < Rebar > sourceRebars , Element destinationHost )` |